In [1]:
import pandas as pd

In [2]:
# 缺失值填入字串 'others'

In [3]:
q_df = pd.DataFrame([['male', 'teacher'],
                    ['male', 'engineer'],
                    ['female', None],
                    ['female', 'engineer']], columns = ['Sex', 'Profession'])

In [4]:
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [5]:
a_df = q_df.fillna('others')

In [6]:
a_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [7]:
# 更進一步將字串做編碼。 此時用甚麼方式做編碼比較合適？為甚麼？

In [8]:
# 使合適用 One-hot Encoding
# 因為資料表中不論是 Profession 還是 Sex 欄位底下的都屬於一般性的資料，不需要針對其做順序性的編碼

In [9]:
OE = pd.get_dummies(a_df[['Profession']])

In [10]:
n_df = pd.concat([a_df, OE], axis = 1)

In [11]:
n_df

,Sex,Profession,Profession_engineer,Profession_others,Profession_teacher
0,male,teacher,0,0,1
1,male,engineer,1,0,0
2,female,others,0,1,0
3,female,engineer,1,0,0